; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 2.0.0
; Author:	Awadh A Al-Ghaamdi <awadh_al_ghaamdi@hotmail.com>
; Homepage:	http://www.alsayra.com/vb/showthread.php?p=2048628
;
; Updating translations:
;   Before updating a translation, please make sure you have the current development version of
;   	Universal Extractor by enabling the 'Install beta updates' option in preferences and searching
;   	for updates by clicking 'Check for Updates' in the help menu.
; 	Make sure to read the messages titled 'Breaking changes' - which can be found at
;		https://github.com/Bioruebe/UniExtract2/issues/2 - for a list of changes to already translated
;   	terms. Please compare the affected translations with the always up-to-date English language file
;		and edit them to reflect the changes.
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file. Simply delete the Homepage line if you don't have one. Credit
;		yourself in the ABOUT_INFO_LABEL term if you want to.
;	Save the file in Unicode format (UTF-16/UCS-2 Little Endian) and send it to the developers -
;		via Github: https://github.com/Bioruebe/UniExtract2/issues/2 or
;		per e-mail to the address listed at https://bioruebe.com/contact/
;
;	The following symbols have special meanings:
;	& 		  - when used in a GUI label or button, it precedes the letter that will be registered
;				as a hotkey. Each letter should only be used once per menu.
;	%name	  - will be replaced with 'Universal Extractor'
;	%n	 	  - indicates a newline character
;	%t	  	  - indicates a tab character
;	%1,%2,... - indicates a string variable that UniExtract will replace
;		The content of each %1,... variable is hardcoded into UniExtract.
;		The numbered variables' order can be switched to fit your language's word order
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&موافق"
CANCEL_BUT = "إ&لغاء"
YES_BUT = "&نعم"
NO_BUT = "&لا"
DELETE_BUT = "&حذف"
COPY_BUT = "&نسخ"
BATCH_BUT = "&دفعة"
SEND_BUT = "&إرسال"
NEXT_BUT = "&التالي >"
PREV_BUT = "< ال&سابق"
CLOSE_BUT = "&إغلاق"
EXIT_BUT = "&خروج"
CONTINUE_BUT = "&متابعة"
FINISH_BUT = "إ&نهاء"
ALWAYS_BUT = "&دائمًا"
NEVER_BUT = "أ&بدًا"
CHECKBOX_REMEMBER = "تذكر اختياري"
CHECKBOX_DONT_ASK_AGAIN = "لا تسأل مرة أخرى"
MAIN_DEST_DIR_LABEL = "&مجلد الوجهة:"
MAIN_FILE_LABEL = "&الأرشيف/المثبت للاستخراج"
MAIN_DIRECTORY_LOCK = "قفل"
MAIN_DIRECTORY_LOCK_TOOLTIP = "يعطّل الاختيار التلقائي لمجلد الوجهة.%nهذا مفيد لاستخراج عدة ملفات إلى نفس المجلد%nمن دون إعادة تحديد الوجهة كل مرة."
MENU_FILE_LABEL = "&ملف"
MENU_FILE_OPEN_LABEL = "&فتح…"
MENU_FILE_KEEP_OPEN_LABEL = "&الإبقاء على %name مفتوحًا"
MENU_FILE_SHOW_LABEL = "&عرض قائمة الدُفعات"
MENU_FILE_CLEAR_LABEL = "&مسح قائمة الدُفعات"
MENU_FILE_LOG_OPEN_LABEL = "فتح أحدث ملف &سجل"
MENU_FILE_LOG_FOLDER_OPEN_LABEL = "فتح &مجلد السجل"
MENU_FILE_LOG_LABEL = "حذف ملفات ال&سجل (%1)"
MENU_FILE_QUIT_LABEL = "إ&نهاء"
MENU_EDIT_LABEL = "ت&حرير"
MENU_EDIT_SILENT_MODE_LABEL = "&الوضع الصامت"
MENU_EDIT_PASSWORD_LABEL = "&قائمة كلمات المرور"
MENU_EDIT_CONTEXT_LABEL = "&عناصر قائمة السياق"
MENU_EDIT_PREFS_LABEL = "إ&عدادات"
MENU_HELP_LABEL = "ت&عليمات"
MENU_HELP_FEEDBACK_LABEL = "إرسال &ملاحظات"
MENU_HELP_PLUGINS_LABEL = "&مدير الملحقات"
MENU_HELP_UPDATE_LABEL = "التحقق من ال&تحديثات"
MENU_HELP_WEB_LABEL = "ال&رسمي %1 موقع"
MENU_HELP_GITHUB_LABEL = "%1 على &GitHub"
MENU_HELP_STATS_LABEL = "&الإحصائيات"
MENU_HELP_PROGDIR_LABEL = "فتح &مجلد البرنامج"
MENU_HELP_CONFIGFILE_LABEL = "فتح ملف الإ&عدادات"
MENU_HELP_ABOUT_LABEL = "&حول"
PREFS_TITLE_LABEL = "إعدادات"
PREFS_UNIEXTRACT_OPTS_LABEL = "خيارات عامة"
PREFS_HISTORY_LABEL = "تتبع م&حفوظات الإرشيف"
PREFS_UPDATEINTERVAL_LABEL = "البحث عن التحديثات:"
PREFS_UPDATE_DAILY = "يوميًا"
PREFS_UPDATE_WEEKLY = "أسبوعيًا"
PREFS_UPDATE_MONTHLY = "شهريًا"
PREFS_UPDATE_YEARLY = "سنويًا"
PREFS_UPDATE_NEVER = "أبدًا"
PREFS_UPDATE_CUSTOM = "كل %1 يوم"
PREFS_FORMAT_OPTS_LABEL = "خيارات إضافية"
PREFS_LANG_LABEL = "ال&لغة:"
PREFS_WARN_EXECUTE_LABEL = "&التحذير قبل تنفيذ الملفات"
PREFS_WARN_EXECUTE_TOOLTIP = "تعتمد بعض طرق الاستخراج على تشغيل الملفات.%nعند تفعيل هذا الخيار، سيظهر تحذير قبل تنفيذ مثل هذه الإجراءات التي قد تكون خطِرة."
PREFS_CHECK_FREE_SPACE_LABEL = "التحقق من المساحة الحرة"
PREFS_CHECK_FREE_SPACE_TOOLTIP = "التحقق من توفر مساحة خالية كافية على القرص قبل الاستخراج."
PREFS_CHECK_UNICODE_LABEL = "التحقق من أحرف يونيكود"
PREFS_CHECK_UNICODE_TOOLTIP = "قد تتسبب بعض المحارف الخاصة (مثل الأحرف اليابانية على الأنظمة غير اليابانية) في مشكلات أثناء الاستخراج.%nإذا واجهت مشكلة عند استخراج مثل هذه الملفات، فعِّل هذا الخيار لإعادة تسميتها مؤقتًا تلقائيًا."
PREFS_APPEND_EXT_LABEL = "إلحاق ال&إمتدادات المفقودة للملفات"
PREFS_APPEND_EXT_TOOLTIP = "إصلاح امتدادات الملفات المفقودة أو الخاطئة."
PREFS_HIDE_TRAY_LABEL = "تعطيل أيقونة شريط النظام"
PREFS_HIDE_STATUS_LABEL = "تعطيل مربع الحالة"
PREFS_HIDE_STATUS_FULLSCREEN_LABEL = "إخفاء مربع الحالة في وضع ملء الشاشة"
PREFS_HIDE_STATUS_FULLSCREEN_TOOLTIP = "وضع الألعاب - يعطّل مربع الحالة تلقائيًا إذا كانت النافذة النشطة تعمل بملء الشاشة"
PREFS_OPEN_FOLDER_LABEL = "فتح مجلد الإخراج بعد الاستخراج"
PREFS_FEEDBACK_PROMPT_LABEL = "طلب الملاحظات"
PREFS_FEEDBACK_PROMPT_TOOLTIP = "عند تفعيل هذا الخيار، سيظهر طلب لإرسال ملاحظات بعد فشل عمليات الاستخراج."
PREFS_WINDOW_POSITION_LABEL = "تذكر حجم النافذة وموضعها"
PREFS_SEND_STATS_LABEL = "إرسال إحصائيات استخدام مجهولة"
PREFS_SEND_STATS_TOOLTIP = "إرسال الإحصائيات تلقائيًا (مثل أنواع الملفات التي تستخرجها أكثر - كملفات zip - والخيارات التي تضبطها ومعرّف مستخدم عشوائي؛%nولا تُجمع أسماء الملفات أو أي معلومات يمكن استخدامها لتحديد هويتك). يساعد هذا في تحديد أكثر الميزات استخدامًا%nفي %name وتركيز التطوير على تحسينها."
PREFS_LOG_LABEL = "إنشاء ملفات سجل"
PREFS_VIDEOTRACK_LABEL = "استخراج مسارات الفيديو"
PREFS_VIDEOTRACK_TOOLTIP = "إذا تم تعطيل هذا الخيار، فسيتم تجاهل مسارات الفيديو عند الاستخراج من ملفات الفيديو.%nوهذا مفيد إذا كنت تحتاج فقط إلى مسارات الصوت وتريد توفير المساحة والوقت."
PREFS_TOPMOST_LABEL = "دائمًا في &المقدمة"
PREFS_BETA_UPDATES_LABEL = "تثبيت التحديثات التجريبية"
PREFS_SOURCE_FILES_LABEL = "الملفات المصدرية"
PREFS_SOURCE_FILES_OPT_ASK = "اسأل"
PREFS_SOURCE_FILES_OPT_DELETE = "احذف"
PREFS_SOURCE_FILES_OPT_KEEP = "احتفظ"
PREFS_SOURCE_FILES_OPT_KEEP_TOOLTIP = "اعرض دائمًا مطالبة بحذف الملفات المصدر أو الاحتفاظ بها."
PREFS_DELETE_ADDITIONAL_FILES_LABEL = "حذف الملفات الإضافية"
PREFS_DELETE_ADDITIONAL_FILES_TOOLTIP = "يقوم %name بترشيح الملفات المستخرجة مسبقًا ونقل الملفات المعروفة بأنها غير مفيدة إلى مجلد باسم '%1'.%nيمكنك هنا اختيار حذف هذه الملفات بدلًا من ذلك."
FEEDBACK_TITLE_LABEL = "الملاحظات"
FEEDBACK_SYSINFO_LABEL = "معلومات النظام:"
FEEDBACK_OUTPUT_LABEL = "مخرجات %name:"
FEEDBACK_MESSAGE_LABEL = "رسالتك/معلومات إضافية:"
FEEDBACK_PRIVACY_ACCEPT_LABEL = "لقد قرأت سياسة الخصوصية وأوافق عليها"
FEEDBACK_PRIVACY_VIEW_LABEL = "عرض سياسة الخصوصية"
CONTEXT_ENTRIES_LABEL = "عناصر قائمة السياق"
CONTEXT_ENABLED_LABEL = "مفعّل"
CONTEXT_ALL_USERS_LABEL = "تفعيل لجميع المستخدمين"
CONTEXT_ADMIN_REQUIRED = "يتطلب هذا الخيار صلاحيات المسؤول"
CONTEXT_FILE_ASSOC_LABEL = "اقترانات الملفات"
CONTEXT_SIMPLE_RADIO = "بسيطة"
CONTEXT_CASCADING_RADIO = "متداخلة"
CONTEXT_CASCADING_RADIO_TOOLTIP = "تتطلب هذه الميزة Windows 7 أو أحدث"
UPDATE_ACTION_INSTALL = "تثبيت التحديث"
UPDATE_STATUS_SEARCHING = "جارٍ البحث عن تحديثات..."
UPDATE_TERM_PROGRAM_FILES = "ملفات برنامج %name"
UPDATE_WHATS_NEW = "ما الجديد؟"
FIRSTSTART_TITLE = "&مساعد التشغيل الأول"
FIRSTSTART_PAGES = "مرحبًا|التفضيلات|عناصر قائمة السياق"
FIRSTSTART_PAGE1 = "مرحبًا بك في %name.%n%nيرجى تخصيص %name بما يناسب احتياجاتك.%n%nلكن أولًا: أمور قانونية.%nيتم توفير هذا البرنامج "كما هو" دون أي ضمان. استخدمه على مسؤوليتك الخاصة. لا يمكن تحميل مؤلفي %name مسؤولية أي أضرار قد تنشأ عن استخدام البرنامج. باستخدام %name فإنك توافق على استخدامه فقط للأغراض القانونية وفقًا للقوانين المحلية والدولية. إذا كنت لا تقبل اتفاقية الترخيص هذه، فلا يُسمح لك باستخدام هذه الأداة."
FIRSTSTART_PAGE2 = "أولًا، يرجى ضبط الخيارات العامة للاستخراج والسلوك العام لـ %name.%n%nيمكن الوصول إلى جميع هذه التفضيلات في أي وقت عبر القائمة الرئيسية."
FIRSTSTART_PAGE3 = "يمكن لـ %name الاندماج بالكامل في قائمة السياق، بحيث يمكن استخراج ملف أو عرض معلومات عامة عن نوعه بنقرة زر أيمن بسيطة على أي ملف ومن دون فتح نافذة البرنامج الرئيسية. يرجى اختيار عناصر قائمة السياق التي تريد إظهارها.%n%nيمكن الوصول إلى جميع هذه التفضيلات في أي وقت عبر القائمة الرئيسية."
FFMPEG_LICENSE_ACCEPT_LABEL = "لقد قرأت اتفاقية الترخيص وأوافق عليها"
FFMPEG_LICENSE_VIEW_LABEL = "عرض اتفاقية الترخيص"
FFMPEG_SELECT_LABEL = "هل لديك FFmpeg بالفعل؟"
FFMPEG_SELECT_TITLE = "تحديد FFmpeg"
STATS_HEADER_STATUS = "التوزيع العام للنتائج"
STATS_HEADER_TYPE = "عمليات الاستخراج حسب نوع الملف"
STATS_STATUS_SUCCESS = "نجاح"
STATS_STATUS_FAILED = "فشل"
STATS_STATUS_FILEINFO = "فحص الملف"
STATS_STATUS_UNKNOWN = "نوع ملف غير معروف / غير مدعوم"
STATS_NO_DATA = "لا توجد بيانات كافية لإنشاء الإحصائيات.%n%nيرجى المحاولة مرة أخرى لاحقًا."
FILESCAN_TITLE = "نتيجة فحص الملف:"
ABOUT_INFO_LABEL = "النسخة الأصلية من %1%nالإصدار 2.0.0 من Bioruebe <%2>%nالإصدار %3 من gvp9000%n%nملف اللغة الإنجليزية من Jared Breland/Bioruebe/gvp9000%n%nصادر تحت %4"
ABOUT_VERSION = "الإصدار %1 (%2)"
METHOD_ADMIN_RADIO = " إداري %1 مثبت"
METHOD_EXTRACTION_RADIO = "%1 إستخراج"
METHOD_HEADER = "%1 إستخراج"
METHOD_RADIO_LABEL = "طريقة الإستخراج"
METHOD_SWITCH_RADIO = "%1 تبديل"
METHOD_NOT_INSTALLER_RADIO = "ليس مُثبّت %1"
METHOD_TEXT_LABEL = "يدعم %name الطرق التالية لاستخراج حزم %1. وللأسف، لا توجد أي من هذه الطرق موثوقة بنسبة 100%%. إذا لم تبدُ الطريقة الافتراضية وكأنها تعمل، فالرجاء إعادة تشغيل %name واختيار طريقة بديلة."
METHOD_UNPACKER_RADIO = "%1 وحدة فك"
METHOD_GAME_LABEL = "يبدو أن الملف %1 عبارة عن أرشيف لعبة. يستطيع %name التعامل مع عدة أنواع من حزم الألعاب، لكنه لا يستطيع تحديد اللعبة التي ينتمي إليها الملف. إذا كان الملف يخص لعبة، فالرجاء تحديدها من القائمة أدناه. وإلا فاختر '%2' أو انقر '%3' لمحاولة استخراج الحزمة بطريقة أخرى."
METHOD_GAME_NOGAME = "ليست لعبة من هذه القائمة"
METHOD_NOT_IN_LIST = "لا شيء مما سبق"
METHOD_FILE_SELECT_LABEL = "يلزم ملف بيانات إضافي لاستخراج %1، لكن %name لا يستطيع تحديد أي ملف هو المطلوب.%n%nيرجى اختيار أحد الخيارات أدناه. إذا لم يعمل الاستخراج بشكل صحيح، فحاول مرة أخرى مع اختيار مختلف."
METHOD_EXTRACTOR_SELECT_LABEL = "%nتحتوي القائمة أدناه على رمز مختصر لكل أداة استخراج/نوع ملف يدعمه %name حاليًا.%n%nيرجى تحديد نوع الاستخراج الذي تريد استخدامه. اختر '%2' لاكتشاف نوع الملف تلقائيًا كما لو كنت تشغّل %name بشكل عادي."
; GUI control functions
EXTRACT_TO = "إستخراج إلى"
OPEN_FILE = "فتح ملف"
SELECT_FILE = "تحديد ملف"
UPDATE_CURRENT = "أنت تستخدم بالفعل أحدث إصدار من %name."
; Common terms
TERM_ARCHIVE = "إرشيف"
TERM_AUDIO = "صوت"
TERM_COMPILED = "مترجم"
TERM_COMPRESSED = "ملف مضغوط"
TERM_CONTAINER = "صيغة حاوية"
TERM_DATABASE = "قاعدة بيانات"
TERM_DISK_IMAGE = "صورة قرص"
TERM_DOWNLOAD = "تنزيل"
TERM_DOWNLOADING = "جارٍ التنزيل"
TERM_EBOOK = "كتاب إنترنت"
TERM_ECARD = "بطاقة إنترنت"
TERM_ENCODED = "ملف مشفر"
TERM_ENCRYPTED = "ملف مشفر"
TERM_ERROR = "خطأ"
TERM_EXECUTABLE = "ملف تنفيذي"
TERM_EXTRACT = "استخراج"
TERM_FILE = "ملف"
TERM_GAME = "لعبة"
TERM_HELP = "ملف تعليمات"
TERM_HOTFIX = "برنامج إصلاح"
TERM_IMAGE = "صورة"
TERM_INSTALLED = "مُثبّت"
TERM_INSTALLER = "مثبت"
TERM_LOADING = "جارٍ التحميل..."
TERM_MERGE_MODULE = "وحدة دمج"
TERM_OVERALL_PROGRESS = "التقدم الإجمالي"
TERM_PACKAGE = "حزمة"
TERM_PAGE = "صفحة"
TERM_PATCH = "رقعة"
TERM_RECONSTRUCTED = "أُعيد بناؤه"
TERM_SCAN = "فحص"
TERM_SCRIPT = "سكربت"
TERM_SFX = "إستخراج-ذاتي"
TERM_STAGE = "مرحلة"
TERM_TESTING = "تجربة"
TERM_TRANSLATION = "ترجمة"
TERM_UNKNOWN = "غير معروف"
TERM_UNPACKED = "غير محزوم"
TERM_UPDATER = "المحدث"
TERM_VIDEO = "فيديو"
; Status messages
SCANNING_FILE = "جارٍ فحص الملف باستخدام %1"
SCANNING_EXE = " %1 فحص الملف بواسطة"
EXTRACTING = " إستخراج الملفات من :"
INIT_WAIT = "إنتظار تهيئة المثبت%nالرجاء الإنتظار"
SENDING_FEEDBACK = "جارٍ إرسال الملاحظات"
INPUT_NEEDED = "مطلوب إدخال من المستخدم"
SEARCHING_PASSWORD = "جارٍ البحث عن كلمة المرور"
TESTING_PASSWORD = "جارٍ تجربة كلمات المرور (%1/%2)"
MOVING_FILE = "جارٍ النقل إلى"
RENAMING_FILES = "جارٍ إعادة تسمية الملفات"
RENAMING_FILES_PROGRESS = "جارٍ إعادة تسمية الملفات (%1/%2)"
PROCESSING = "جارٍ المعالجة..."
CLEANING_UP = "جارٍ التنظيف..."
; Custom prompts
INIT_COMPLETE = "اكتملت التهيئة. الرجاء إغلاق المثبت ثم النقر على موافق للمتابعة."
UNPACK_PROMPT = "قد يكون هذا الملف مضغوطًا باستخدام ضغط %1.%n%nهل تريد فك ضغطه؟%nوإلا فسيستمر تحليل الملف.%n%nملاحظة: سيكون اسم الملف بعد الفك:%n%2"
UNPACK_FAILED = "خطأ : %1%nتعذر التفكيك"
UNPACK_AGAIN = "تم فك %1 بنجاح.%n%nهل تريد أن يحاول %name استخراج الملف %2؟"
NSIS_BINFILES = "ملاحظة: تم استخراج %1 بنجاح.%nولكن توجد ملفات data.bin في نفس المجلد الذي يحتوي على الملف %2. قد تكون هذه جزءًا من ملفات التثبيت.%n%nانقر موافق لفكها باستخدام %name أو إلغاء للإيقاف."
WARN_EXECUTE = "لاستخراج ملفات من هذا النوع، يجب تشغيل الملف مباشرة.%n%nإذا كنت تعتقد أن هذا الملف قد يكون ضارًا، فمن المستحسن ألا تتابع."
FEEDBACK_SUCCESS = "شكرًا لك على ملاحظاتك. ستتم معالجة رسالتك قريبًا."
FEEDBACK_PROMPT = "لتحسين الإصدارات القادمة من %name، يمكنك إبلاغ المطورين بالمشكلات.%nتحتوي سجلات الاستخراج على معلومات قيّمة عن الملف والأخطاء المحتملة التي ربما حدثت أثناء الاستخراج.%n%nهل تريد فتح واجهة الملاحظات الآن؟"
FEEDBACK_PRIVACY = "إشعار الخصوصية: تُخزَّن ملفات الملاحظات على خوادمنا حتى يعالجها أحد المطورين ثم تُحذف بعد ذلك. لن تتم مشاركة أي بيانات مع أطراف ثالثة. يمكنك طلب حذفها في أي وقت عبر البريد الإلكتروني.%n%nقد يتضمن المحتوى المُسجَّل معلومات عن النظام وكذلك أجزاءً من محتوى الملف. إذا كنت لا تريد إرسال معلومات محددة، فما عليك سوى حذفها.%n%nهل تقبل اتفاقية الخصوصية هذه وتريد إرسال الرسالة؟ وإلا فلن يتم نقل أي شيء."
FEEDBACK_OUTDATED = "تحذير: أنت تستخدم إصدارًا قديمًا من %name.%n%nقبل الإبلاغ عن مشكلة، يرجى التأكد من أنها ما زالت موجودة في أحدث إصدار. شكرًا لك!"
FFMPEG_NEEDED = "يبدو أن %1 ملف وسائط متعددة.%n%nلاستخراج جميع مسارات الفيديو والصوت، يلزم FFmpeg. ما عليك سوى النقر على الزر %2 وسيتم تنزيل كل شيء وإعداده تلقائيًا."
PROGRAM_FILES_MISSING = "تحذير: ملفات برنامج %name غير مكتملة.%n%nهل تريد إعادة تنزيل جميع الملفات المفقودة تلقائيًا؟"
PLUGIN_MISSING = "لاستخراج %1، يلزم برنامج مساعد إضافي.%n%nيرجى استخدام الزر أدناه لفتح مدير الملحقات وتنزيل الوحدة المساعدة المحددة. ثم استخدم الزر '%2' لإضافتها إلى %name. بعد إغلاق مدير الملحقات، سيستمر الاستخراج."
UPDATE_PROMPT = "يتوفر تحديث جديد لـ %1.%n%nهل تريد تنزيله الآن؟"
FILE_COPY = "لمعالجة الملف %1 بشكل صحيح، يجب إنشاء نسخة منه. وقد يستغرق هذا بعض الوقت حسب حجم الملف.%n%nيرجى التأكد من توفر مساحة خالية كافية ثم انقر موافق للمتابعة."
FILE_DELETE = "تم استخراج الملف %1 بنجاح. هل تريد أن يحذف %name الملف الأصلي؟%n%nملاحظة: قد تكون الملفات المستخرجة غير قابلة للاستخدام. انقر نعم فقط إذا كنت متأكدًا من أن الاستخراج تم كما ينبغي.%n(يمكن تعطيل هذه الرسالة من الخيارات.)"
BATCH_DUPLICATE = "الملف %1 موجود بالفعل في قائمة الدُفعات.%n%nهل تريد إضافته مرة أخرى وبالتالي استخراجه مرتين؟"
NO_FREE_SPACE = "تحذير:%nمحرك الإخراج %1 يحتوي على مساحة خالية أقل من حجم ملف الإدخال.%n%nالمساحة الخالية:%t%2 م.ب%nالمساحة المطلوبة:%t>%3 م.ب%nالفرق:%t~%4 م.ب"
CONTEXT_DANGEROUS = "تحذير:%nقد يكون تغيير اقترانات الملفات خطيرًا. على سبيل المثال، قد يؤدي تغيير الأوامر الافتراضية لملفات exe إلى عدم قدرة التطبيقات على العمل مطلقًا. يرجى التأكد من أنك تعرف ما تفعله.%n%nهل تريد المتابعة حقًا؟"
ELEVATION_REQUIRED = "تم رفض الوصول.%n%nسيُعاد تشغيل %name الآن بصلاحيات مرتفعة. يرجى المحاولة مرة أخرى بعد ذلك."
ACCESS_DENIED = "تم رفض الوصول.%n%nيعمل %name بالفعل بصلاحيات مرتفعة. يرجى التأكد من امتلاكك الأذونات اللازمة لتنفيذ هذا الإجراء ثم حاول مرة أخرى."
MOVE_FAILED = "تعذر نسخ %1 إلى %2. إذا كان المسار أو الاسم يحتوي على محارف خاصة، فحاول إعادة تسمية الملف أو نقله إلى مجلد باسم عادي. بهذه الطريقة لن يضطر %name إلى نسخه إلى المجلد المؤقت. ثم ابدأ الاستخراج مرة أخرى."
; Help text
HELP_TITLE = "%name: استخدام سطر الأوامر"
HELP_USAGE_TITLE = "الاستخدام:"
HELP_USAGE = "%1 <file> [<destination> | /scan | /sub | /last] [/silent] [/batch] [/type[=<type>]]"
HELP_ARGUMENTS = "المعاملات المدعومة:"
HELP_SCAN = "%n   %1%t%tعرض معلومات عن نوع الملف، ولا يستخرج أي ملفات"
HELP_FILENAME = "   <file>%t%tمسار الملف المراد استخراجه"
HELP_DESTINATION = "%n     الوجهة%tالمجلد المراد الإستخراج فيه"
HELP_SILENT = "%n   %1%t%tالوضع الصامت (يخفي جميع المطالبات)"
HELP_BATCH = "%n   %1%t%tإضافة الملف إلى قائمة الدُفعات"
HELP_TYPE = "%n   %1<type>%tاعتبار الملف المراد استخراجه من النوع <type>%n%t%tأو عرض نافذة اختيار النوع إذا لم يتم تحديد نوع"
HELP_SUB = "%n%nتمرير %1 بدلًا من مجلد الوجهة يوجّه %name إلى الاستخراج داخل مجلد فرعي يحمل اسم الأرشيف؛ "
HELP_LAST = "مع %1 سيتم استخدام آخر مجلد تم استعماله."
HELP_NOARGS = "%n%nسيؤدي تشغيل %name بدون أي معاملات إلى فتح واجهة المستخدم الرسومية."
HELP_MORE = "%n%nيمكن العثور على توثيق كامل، بما في ذلك وسيطات سطر الأوامر الأقل استخدامًا، في المساعدة عبر الإنترنت المرتبطة أدناه."
HELP_EXAMPLE_TITLE = "مثال:"
HELP_EXAMPLE = "%1 "C:\Files\example.zip" "C:\unpacked""
HELP_DOCS_LINK = "عرض مرجع سطر الأوامر الكامل"
; Warning messages
WARN_CONVERSION_FAILED = "فشلت المحادثة التلقائية للملف."
WARN_MOVE_FAILED = "تعذر نقل %1 من الملفات/المجلدات."
; Error messages
UNKNOWN_FILETYPE_TITLE = "نوع ملف غير معروف"
UNKNOWN_FILETYPE = "لا يمكن استخراج %1. تعذر تحديد نوع الملف بدقة.%n%nإذا كانت لديك معلومات إضافية عن هذا النوع من الملفات، فالرجاء التواصل معنا باستخدام نموذج الملاحظات."
INVALID_FILE = "تعذر العثور على الملف المراد استخراجه،%n%n%1%nيرجى تحديد إدخال صالح.%n%n%1"
INVALID_DIR = "تعذر إنشاء %1. قد لا تملك الأذونات المطلوبة للكتابة إلى المجلد.%n%nيرجى تحديد وجهة صالحة أو محاولة تشغيل %name بصلاحيات المسؤول."
NO_HISTORY = "تعذر استخراج %1.%nتعذر قراءة آخر مجلد مستخدم.%n%nيرجى التأكد من أن %2 مفعّل وأنك قد استخرجت ملفًا واحدًا على الأقل قبل محاولة الاستخراج إلى آخر مجلد مستخدم."
EXTRACT_FAILED = "تعذر استخراج %1.%n%nيبدو أنه %2، وهو نوع مدعوم، لكن الاستخراج فشل.%n%nهل تريد أن يقوم %name بإنشاء ملف سجل وعرضه مع مزيد من المعلومات؟"
NOT_PACKED = "تعذر استخراج %1، فالملف غير مضغوط بل هو %n%n%2"
DOWNLOAD_FAILED = "تعذر تنزيل الملف %1. يرجى التأكد من اتصالك بالإنترنت ثم حاول مرة أخرى."
UPDATECHECK_FAILED = "فشل التحقق من وجود تحديثات. يرجى التأكد من اتصالك بالإنترنت ثم حاول مرة أخرى."
UPDATE_FAILED = "فشل تحديث بعض الملفات.%n%nيرجى المحاولة مرة أخرى لاحقًا، أو تشغيل %name كمسؤول، أو إعادة تنزيل %name."
UPDATE_NOADMIN = "فشل %name في طلب صلاحيات المسؤول.%n%nيرجى النقر بزر الماوس الأيمن على أيقونة برنامج %name واختيار 'تشغيل كمسؤول'، ثم ابحث عن التحديثات مرة أخرى من خلال قائمة المساعدة."
FFMPEG_MOVE_FAILED = "تعذر إعداد FFmpeg بشكل صحيح. يرجى النقر بزر الماوس الأيمن على أيقونة برنامج %name واختيار 'تشغيل كمسؤول' ثم المحاولة مرة أخرى."
FFMPEG_INVALID_FILE = "الملف المحدد ليس إصدارًا مدعومًا من FFmpeg.%n%nيتوفر FFmpeg في نسختين: ملف تنفيذي كبير واحد ('static')، أو مجلد يحتوي على ملف تنفيذي صغير جدًا والعديد من ملفات DLL ('shared'). يدعم %name النسخة الأولى فقط."
FEEDBACK_EMPTY = "يرجى تقديم أكبر قدر ممكن من المعلومات لضمان معالجة سريعة لملاحظاتك."
FEEDBACK_ERROR = "فشل إرسال الملاحظات. يرجى المحاولة مرة أخرى لاحقًا أو إرسال تقريرك عبر البريد الإلكتروني أو على Github. شكرًا لك.%n%nحدث الخطأ التالي: %1"
FEEDBACK_PRIVACY_NOT_ACCETPED = "يرجى قبول سياسة الخصوصية لإرسال الملاحظات."
LICENSE_NOT_ACCEPTED = "يرجى قبول اتفاقية الترخيص للمتابعة."
BATCH_FINISH = "انتهت معالجة الدُفعات، لكن لم يتم استخراج جميع الملفات بنجاح. نتج عن الملفات التالية خطأ:%n%n%1%nلمزيد من المعلومات، يرجى قراءة الملفات المناسبة في مجلد السجل (متاح فقط إذا كان التسجيل مفعّلًا)."
NOT_SUPPORTED_TITLE = "نوع ملف غير مدعوم"
NOT_SUPPORTED = "لا يمكن استخراج %1.%n%nلا يدعم %name هذا النوع من الملفات.%n%nإذا كانت لديك معلومات عن كيفية استخراج هذا الملف، فالرجاء إرسال رسالة إلينا والمساعدة في جعل %name أفضل."
MISSING_EXE = "لا يمكن استخراج %1.%n%nتعذر العثور على الوحدة المساعدة %2."
EXTRACT_TIMEOUT = "تعذر استخراج %1.%n%nتم الوصول إلى المهلة الزمنية. إذا كانت المشكلة مؤقتة، فقد تنجح المحاولة مرة أخرى."
WRONG_PASSWORD = "تعذر استخراج %1.%n%nالملف محمي بكلمة مرور وكلمة المرور التي أدخلتها غير صحيحة.%n%nنصيحة: استخدم البحث التلقائي المضمّن عن كلمة المرور اعتمادًا على قائمة كلمات مرور قابلة للتهيئة يمكن العثور عليها في قائمة %2."
NO_FREE_SPACE_ERROR = "تعذر استخراج %1.%n%nلا توجد مساحة كافية على محرك الإخراج. وفّر مساحة كافية ثم حاول مرة أخرى."
MISSING_PART = "تعذر استخراج %1.%n%nيتكوّن الأرشيف من عدة أجزاء. جميعها مطلوبة لاستخراجه، ولكن تعذر العثور على بعض الأجزاء.%n%nتأكد من وجود جميع الأجزاء في المجلد نفسه ثم حاول مرة أخرى."
PLUGIN_IMPORT_MISSINGFILES = "فشل استيراد الملحق %1.%n%nلم يتم تحديد جميع الملفات. يرجى إعادة المحاولة وتحديد جميع الملفات التالية:%n%n%2"
MISSING_DEFINITION = "لا يمكن استخراج %1.%n%nتعذر العثور على ملف التعريف %2.%n%nإذا كان هذا ملحقًا مخصصًا، فتأكد من إعداده بشكل صحيح."
OPEN_URL_FAILED = "فشل %name في فتح رابط الويب المطلوب.%n%nيرجى فتح متصفحك المفضل وإدخال عنوان URL التالي يدويًا:"
; Plugin descriptions
PLUGIN_SUPPORTED_FILETYPES = "أنواع الملفات المدعومة:"
PLUGIN_ARC_CONV = "أداة استخراج لعدة أرشيفات ألعاب"
PLUGIN_ISCAB = "جزء من حزمة InstallShield لاستخراج ملفات cab. قد يعمل بشكل أفضل من الاستخراج العام في Universal Extractor، لكنه أداة تجارية (غير مجانية)."
PLUGIN_THINSTALL = "أداة استخراج للبرامج التي جُعلت محمولة باستخدام Thinstall"
PLUGIN_UNREAL = "أداة استخراج لأرشيفات Unreal Engine"
PLUGIN_WINTERMUTE = "أداة استخراج لأرشيفات ألعاب محرك WinterMute"
PLUGIN_CI = "ملحق لمثبتات CreateInstall؛ نزّل وثبّت ثم انسخ الملفات %1 و%2 و%3 إلى \bin"
PLUGIN_DGCA = "أداة فك ضغط لأرشيفات DGCA"
PLUGIN_BOOTIMG = "أداة استخراج لصور إقلاع Android"
PLUGIN_IS5COMP = "دعم استخراج لأرشيفات خزائن InstallShield القديمة"
PLUGIN_WOLF = "أداة استخراج إضافية تُستخدم لأرشيفات ألعاب WOLF RPG المشفرة"
PLUGIN_EXTSIS = "أداة استخراج للحزم الأحدث من Symbian OS"
PLUGIN_BITROCK = "أداة استخراج لمثبتات Bitrock Install Builder"
; Context Menu integration
EXTRACT_FILES = "إستخراج ال&ملفات..."
EXTRACT_HERE = "إستخراج &هنا"
EXTRACT_SUB = "إستخراج إلى مجلد &فرعي"
EXTRACT_LAST = "استخراج إلى آخر &مجلد"
SCAN_FILE = "فحص ال&ملف"
; Other
DIR_ADDITIONAL_FILES = "ملفات إضافية"
; Uninstaller
UNINSTALL = "إزالة التثبيت"
UNINSTALL_TITLE = "إزالة تثبيت %name"
UNINSTALL_LABEL = "إذا كنت تخطط لتثبيت %name مرة أخرى، يمكنك اختيار الاحتفاظ بإعداداتك هنا. وإلا فمن الآمن حذف جميع بيانات المستخدم."
UNINSTALL_REMOVE_LOGS = "إزالة ملفات السجل"
UNINSTALL_REMOVE_USERDATA = "إزالة جميع بيانات المستخدم والإعدادات"